<div class="projectDescription">
   <div class="description-head">
      <h3 class="text-center">Краткое описание проекта.</h3>
   </div>
   <p class="description flex">
      <span class="first-word"><b>Laravel осваивал по книге и по сайту</b></span>
      <a class="description_link" href="https://laravel.com/docs/8.x/cache#cache-usage" target="_blank" titile="Laravel">
         Laravel.com
      </a>
   </p>
   <p class="description">
      <span class="first-word">При</span> установке и настройке Фреймворка Ларавел, не удалось установить Node.js.
      Поэтому файлы CSS и js подключены, как обычные html файлы с расширением blade.php, а также не возможны опции языка экспорт, импорт.
   </p>
   <p class="description">
      <span class="first-word">Веб</span> приложение раскрывается для всех на стартовой странице, где в голове приложения есть кнопки
      для входа и регистрации. В контенте по центру фото книги по которой учился. С лева техническое задание,
      а с права описание проекта.
   </p>
   <p class="description">
      <span class="first-word">После</span> регистрации или входа пользователь оказывается на странице категорий товаров. В голове уже нет кнопок для входа и регистрации, но есть кнопка корзины и кнопка с именем зарегистрированного пользователя.
      В хлебных крошках ссылка на стартовую страницу в виде домика.
      Под картинками категорий кнопочки пагинации.
   </p>
   <p class="description">
      <span class="first-word">Выбрав</span> категорию товара и сделав клик по нему, пользователь оказывается на странице продуктов.
      В голове ничего не меняется, а в хлебных крошках будет ссылка домик на стартовую страницу и
      ссылка на все категории. При наведении на картинку она будет приближаться,
      а под ней есть кнопка добавить товар в корзину. После нажатия по ней, на ней появится галочка,
      а в корзине, что в голове отобразится количество товара в ней. Ниже расположены кнопки пагинации.
   </p>
   <p class="description" style="order: 8;">
      <span class="first-word">Внизу</span> каждой страницы есть имитация подвала приложения.
   </p>
   <p class="description">
      <span class="first-word">Выход</span> из диалоговых окон модального блока осуществляется кликом по кнопке 
      <button type="button" class="btn-close butt-example">
         <svg xmlns='http://www.w3.org/2000/svg' width="22" height="22" viewBox='0 0 16 16' fill='currentColor'>
            <path d='M.293.293a1 1 0 011.414 0L8 6.586 14.293.293a1 1 0 111.414 1.414L9.414 8l6.293 6.293a1 1 0 01-1.414 1.414L8 9.414l-6.293 6.293a1 1 0 01-1.414-1.414L6.586 8 .293 1.707a1 1 0 010-1.414z'/>
         </svg>
      </button> или кликом за пределами диалогового окна.
   </p>
   <p class="description">
      <span class="first-word">Корзина</span> открывается, как пустая, так и с выбранным товаром. Увеличить или уменьшить количество продукта можно нажимая кнопки ( + или - ).
      После нажатия на кнопку «Оформить заказ» заказ будет сохранён в таблице БД, на фронтенд придёт уведомление об этом и о том,
      что на вашу электронную почту отправлена электронная квитанция. Сам html документ квитанции будет перехвачен и записан в файл логированния.
   </p>
</div>