<div class="technicalTask">
   <div class="technical-head">
      <h3 class="text-center">Техническое задание для портфолио.</h3>
      <h5>Написать сайт магазина с:</h5>   
   </div>
   <ul class="outer">
      <li>Регистрацией; </li>
      <li>Входом по паролю;</li>
      <li>Страница со списком категорий товаров</li>
         <ul class="inner">
            <li>Выбор категории товара;</li>
         </ul>
      <li>Страница с товаром выбранной категории</li>
         <ul class="inner">
            <li>Выбор товара с добавлением его в корзину;</li>
            <li>В корзине изменение количества выбранного товара;</li>
            <li>При оформлении покупки добавить список выбранных товаров в таблицу ордер БД,</li>
            <li>Для дальнейшей аналитики.</li>
         </ul>
      <li>На сайте использовать:</li>
         <ul class="inner">
            <li>Механизм сессии;</li>
            <li>Базу данных MySQL;</li>
            <li>Код писать в стиле ООП.</li>
         </ul>
   </ul>
</div>
